<?php

// Функція для розпаковки масиву у читабельному форматі
function debug($arr)
{
    // print_r - метод для розпаковки масиву
    echo '<pre>' . print_r($arr, true) . '</pre>';
}

/*
Іноді не зручно використовувати простір імен для доступу до функцій, як от \app\controllers\debug(Yii::$app);
Замість цього можна інпортувати простір імер у файл функцій
(створити бібліотеку функцій можна у папці web або у корені додатку, наприклад functions.php)
Після чого потрібно підключити даний файл функцій у точці входу до додатку web/index.php