<?php

use yii\db\Migration;

/**
 * Handles the creation of table `{{%category}}`.
 */
class m240805_084355_create_category_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->createTable('{{%category}}', [
            'id' => $this->primaryKey(),
            'name' => $this->string(255)->notNull()->unique()->comment('Назва категорії'),
            'description' => $this->text()->null()->comment('Опис категорії'),
            'created_at' => $this->timestamp()->defaultExpression('CURRENT_TIMESTAMP')->comment('Дата створення'),
            'updated_at' => $this->timestamp()->defaultExpression('CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP')->comment('Дата оновлення'),
        ]);

        // Insert initial data into category table
        $this->batchInsert('{{%category}}', ['name', 'description'], [
            ['Електроніка', 'Категорія для електронних пристроїв та гаджетів'],
            ['Книги', 'Категорія для книг різних жанрів'],
            ['Одяг', 'Категорія для одягу та аксесуарів'],
            ['Продукти харчування', 'Категорія для продуктів харчування та напоїв'],
            ['Спорт', 'Категорія для спортивного обладнання'],
            ['Іграшки', 'Категорія для дитячих іграшок'],
            ['Меблі', 'Категорія для меблів та домашнього інтер\'єру'],
            ['Косметика', 'Категорія для косметичних засобів'],
            ['Автотовари', 'Категорія для автомобільних товарів'],
            ['Зоотовари', 'Категорія для товарів для тварин'],
            ['Музика', 'Категорія для музичних інструментів та аксесуарів'],
            ['Відеоігри', 'Категорія для відеоігор та аксесуарів'],
            ['Гарнітура', 'Категорія для навушників та мікрофонів'],
            ['Побутова техніка', 'Категорія для побутової техніки'],
            ['Мистецтво', 'Категорія для творів мистецтва та ремесел'],
            ['Годинники', 'Категорія для годинників та ювелірних виробів'],
            ['Кухонне приладдя', 'Категорія для кухонних приладів'],
            ['Сад та город', 'Категорія для садових та городніх товарів'],
            ['Побутова хімія', 'Категорія для побутової хімії'],
            ['Інструменти', 'Категорія для будівельних та ремонтних інструментів'],
        ]);
    }


    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropTable('{{%category}}');
    }
}
