<?php

use yii\db\Migration;

/**
 * Handles the creation of table `{{%articles}}`.
 */
class m240809_055810_create_articles_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->createTable('{{%articles}}', [
            'id' => $this->primaryKey(),
            'name' => $this->string(255)->notNull(),
            'description' => $this->text(),
            'created_at' => $this->integer()->notNull(),
            'updated_at' => $this->integer()->notNull(),
            'status' => $this->integer()->notNull()->defaultValue(1),
        ]);

        $this->batchInsert('articles', 
        ['name', 'description', 'created_at', 'updated_at', 'status'], [
        ['Курс з веб-розробки', 'Курс охоплює основи HTML, CSS, та JavaScript.', time(), time(), 1],
        ['Курс з Python', 'Інтенсивний курс з вивчення основ Python.', time(), time(), 1],
        ['Курс з баз даних', 'Курс присвячений вивченню SQL та робочих процесів з базами даних.', time(), time(), 1],
        ['Курс з DevOps', 'Курс розглядає автоматизацію процесів розгортання та CI/CD.', time(), time(), 1],
        ['Курс з тестування', 'Основи тестування програмного забезпечення, включаючи ручне та автоматизоване тестування.', time(), time(), 1],
        ['Курс з мобільної розробки', 'Розробка мобільних додатків на платформах Android та iOS.', time(), time(), 1],
        ['Курс з проектного менеджменту', 'Курс охоплює основи управління проектами в IT.', time(), time(), 1],
        ['Курс з UI/UX дизайну', 'Основи користувацького досвіду та інтерфейсного дизайну.', time(), time(), 1],
        ['Курс з машинного навчання', 'Курс для ознайомлення з базовими поняттями та алгоритмами машинного навчання.', time(), time(), 1],
        ['Курс з кібербезпеки', 'Введення в основи захисту інформації та кібербезпеки.', time(), time(), 1],
        ['Курс з Cloud Computing', 'Основи роботи з хмарними сервісами, такими як AWS та Azure.', time(), time(), 1],
        ['Курс з цифрового маркетингу', 'Стратегії цифрового маркетингу, включаючи SEO та соціальні мережі.', time(), time(), 1],
        ['Курс з блокчейну', 'Введення в технологію блокчейн та криптовалюти.', time(), time(), 1],
        ['Курс з штучного інтелекту', 'Курс з основ AI та його застосувань в реальних проектах.', time(), time(), 1],
        ['Курс з кросплатформової розробки', 'Розробка додатків, які працюють на різних платформах.', time(), time(), 1],
        ['Курс з електронної комерції', 'Основи створення та управління онлайн-магазинами.', time(), time(), 1],
        ['Курс з великих даних', 'Обробка та аналіз великих обсягів даних з використанням сучасних технологій.', time(), time(), 1],
        ['Курс з фінансових технологій', 'Введення в світ фінансових технологій та їх застосувань.', time(), time(), 1],
        ['Курс з графічного дизайну', 'Основи роботи з графічними редакторами та створення візуального контенту.', time(), time(), 1],
        ['Курс з інтернету речей (IoT)', 'Введення в IoT та його вплив на сучасний світ.', time(), time(), 1],
    ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropTable('{{%articles}}');
    }
}
